# Homebrew taps
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/services"
tap "mac-cleanup/mac-cleanup-py"
tap "stripe/stripe-cli"
tap "homebrew-ffmpeg/ffmpeg"

# CLI and system utilities
# Run GitHub Actions locally
brew "act"
# Recompression utilities for PNG, MNG, ZIP, and GZ files
brew "advancecomp"
# Download manager with resuming and segmented downloading
brew "aria2"
# Record and share terminal sessions
brew "asciinema"
# System monitoring tool with a clean interface
brew "btop"
# GNU core utilities for basic file, shell, and text operations
brew "coreutils"
# Colored output for tail command
brew "colortail"
# Command-line tool for transferring data with URLs
brew "curl"
# Command-line fuzzy finder for searching files
brew "fzf"
# Cryptographic encryption and signing (GPG)
brew "gnupg"
# GNU grep, egrep, and fgrep
brew "grep"
# Linter for Dockerfiles
brew "hadolint"
# Syntax highlighting for text files
brew "highlight"
# User-friendly alternative to cURL
brew "httpie"
# HTTP request performance statistics
brew "httpstat"
# Interactive process monitoring tool
brew "htop"
# Image processing library
brew "imagemagick"
# Efficient memory allocator for high-performance applications
brew "jemalloc"
# Command-line JSON processor
brew "jq"
# Simple terminal UI for Docker
brew "lazydocker"
# Git UI for terminal users
brew "lazygit"
# Library for interfacing with foreign functions in C
brew "libffi"
# Library for manipulating PNG images
brew "libpng"
# Generic support script for libraries
brew "libtool"
# YAML parser
brew "libyaml"
# Package configuration and metadata toolkit
brew "pkgconf"
# Fast text search tool
brew "ripgrep"
# Formatter for shell scripts
brew "shfmt"
# Modern and customizable shell prompt
brew "starship"
# Terminal multiplexer for managing multiple terminal sessions
brew "tmux"
# Display directory structure in a tree-like format
brew "tree"
# Execute a program periodically with real-time output
brew "watch"
# Command-line file downloader
brew "wget"
# HTTP benchmarking tool
brew "wrk"
# Linter for YAML files
brew "yamllint"
# Compression library for handling zip files
brew "zlib"
# Advanced UNIX shell (command interpreter)
brew "zsh"
# Fish-like command auto-suggestions for zsh
brew "zsh-autosuggestions"
# Fast syntax highlighting for zsh
brew "zsh-fast-syntax-highlighting"
# Syntax highlighting for zsh shell scripts
brew "zsh-syntax-highlighting"
# ZSH plugin that reminds you to use existing aliases
brew "zsh-you-should-use"

# Development and database tools
# Version manager for multiple programming languages
brew "asdf"
# Generates configuration scripts for compiling software
brew "autoconf"
# Generates Makefiles for software builds
brew "automake"
# Official AWS command-line interface
brew "awscli"
# Caching compiler to speed up C/C++ builds
brew "ccache"
# Cross-platform build system
brew "cmake"
# Interactive monitoring tool for Docker containers
brew "ctop"
# Define and run multi-container Docker applications
brew "docker-compose"
# CLI for managing DigitalOcean services
brew "doctl"
# GNU compiler collection for C/C++
brew "gcc"
# GitHub command-line tool
brew "gh"
# Distributed version control system
brew "git"
# Advanced diff viewer for Git
brew "git-delta"
# PostgreSQL client
brew "libpq"
# Open-source relational database management system
brew "mariadb"
# MySQL command-line client
brew "mysql-client"
# Modern, structured shell with scripting capabilities
brew "nushell"
# Cryptography and SSL/TLS toolkit
brew "openssl@3"
# Process manager for Procfile-based applications
brew "overmind"
# Command-line interface for PostgreSQL with auto-completion
brew "pgcli"
# PostgreSQL database server (version 14)
brew "postgresql@14"
# Google Protocol Buffers serialization tool
brew "protobuf"
# Python programming language (version 3.10)
brew "python@3.10"
# Ruby performance profiler
brew "rbspy"
# HTTP benchmarking and regression testing tool
brew "siege"
# SQL linter and auto-formatter
brew "sqlfluff"
# CLI tool for interacting with the Stellar network
brew "stellar-cli"
# Stripe command-line interface
brew "stripe/stripe-cli/stripe"
# Tool for counting lines of code in projects
brew "tokei"
# YAML formatter
brew "yamlfmt"

# Multimedia and productivity tools
# Command-line tool for audio and video manipulation
brew "ffmpeg"
# Version 4 of FFmpeg
brew "ffmpeg@4"
# Graphics library for image manipulation
brew "gd"
# Graph visualization software
brew "graphviz"
# Library for HEIF image format support
brew "libheif"
# OpenVINO toolkit for AI model inference
brew "openvino"
# High-performance image processing library
brew "vips"
# Feature-rich audio/video downloader
brew "yt-dlp"

# GUI Applications (Casks)
# Application launcher and productivity tool
cask "alfred"
# GUI for managing Homebrew packages
cask "applite"
# Arc web browser
cask "arc"
# Organize menu bar icons
cask "bartender"
# Secure password manager
cask "bitwarden"
# Window management tool
cask "divvy"
# Docker Desktop for macOS
cask "docker"
# JetBrains Mono font
cask "font-jetbrains-mono"
# JetBrains Mono Nerd Font
cask "font-jetbrains-mono-nerd-font"
# Hide menu bar icons for a cleaner look
cask "hiddenbar"
# Advanced terminal emulator for macOS
cask "iterm2"
# File archiver and compressor
cask "kekaexternalhelper"
# Expose localhost to the internet
cask "ngrok"
# Retro video game emulator
cask "openemu"
# UI/UX design tool
cask "sketch"
# GUI tool for relational databases
cask "tableplus"
# Time-lapse video creation tool
cask "time-lapse-assembler"
# Media player for multiple formats
cask "vlc"
# Multiplayer code editor
cask "zed"
# Video conferencing platform
cask "zoom"

